[
  {
    "id": "kasa",
    "title": "Kasa",
    "update" :"27/03/2023",
    "cover": "kasa-miniature.webp",
    "pictures": ["kasa-1.webp", "kasa-2.webp"],
    "description": [
      "Este projeto tinha como objetivo uma reformulação total do aplicativo Kasa, com uma migração para JavaScript, incorporando Node.JS no lado do back-end e React no lado do front-end.",
      "O início do projeto React envolveu o desenvolvimento de componentes e rotas de acordo com os layouts disponibilizados no Figma, utilizando dados extraídos de um arquivo JSON de anúncios imobiliários."
    ],
    "actions": [
      "Utilização do Create React App",
      "Desenvolvimento de componentes React e rotas React Router",
      "Utilização de um arquivo JSON com anúncios de imóveis para construir o frontend",
      "Implementação dos layouts do Figma, garantindo a lógica de componentes reutilizáveis",
      "Adoção do Sass para estilização e animação da interface web"
    ],
    "Site": "https://kasa-lake.vercel.app/",
    "Repo": "https://github.com/augusto-mattos/kasa",
    "stack": ["Sass", "React", "React Router", "Figma"]
  },
  {
    "id": "724-events",
    "title": "724 Events",
    "update" :"20/12/2023",
    "cover": "724events-miniature.webp",
    "pictures": ["724events-1.webp", "724events-2.webp"],
    "description": [
      "O projeto 724 Events se concentrou na depuração de um site de uma agência de eventos afetado por bugs.",
      "Usando React e Jest, as ações realizadas incluíram a análise dos problemas, a revisão do código para identificar outros bugs, a resolução dos problemas detectados e a redação de um documento com cenários de teste. As Chrome DevTools foram usadas para depuração web, e os testes unitários e de integração existentes foram integrados para garantir a estabilidade do site após as correções."
    ],
    "actions": [
      "Análise dos problemas listados antecipadamente",
      "Revisão do código para identificar outros bugs",
      "Resolução dos bugs detectados",
      "Redação de um documento de testes",
      "Utilização das Chrome DevTools para depuração",
      "Criação e aplicação dos testes unitários e de integração existentes no processo de correção de bugs"
    ],
    "Site": "https://debuggez-une-application-react-js-am.vercel.app/",
    "Repo": "https://github.com/augusto-mattos/Debuggez-une-application-React.JS-AM",
    "stack": ["React", "Jest"]
  },
  {
    "id": "argent-bank",
    "title": "Argent Bank",
    "update" :"17/01/2024",
    "cover": "argent-bank-miniature.webp",
    "pictures": ["argent-bank-1.webp", "argent-bank-2.webp"],
    "description": [
      "Este projeto começou com a fase 1, focada na autenticação de usuários. A partir do HTML e CSS fornecidos, uma aplicação web foi criada com React, seguindo os padrões do Green Code. A integração incluiu a chamada de uma API para obter os dados do usuário e acessar a aplicação. Redux foi implementado para gerenciar o estado global, permitindo que os usuários visitassem a página inicial, fizessem login e logout, e visualizassem seu perfil. A modificação do nome e sobrenome foi restrita, mas a possibilidade de modificar o nome de usuário (username) foi permitida.",
      "A fase 2 envolveu a elaboração de uma documentação Swagger detalhada para as rotas de API relacionadas às transações, levando em consideração as necessidades específicas na evolução da aplicação e garantindo a consistência com os desenvolvimentos anteriores."
    ],
    "actions": [
      "Criação da aplicação com React",
      "Implementação do Redux para gerenciamento do estado global",
      "Gerenciamento da autenticação dos usuários com Private Routes e chamada de uma API para dados do usuário",
      "Integração das páginas seguindo as boas práticas do Green Code, otimizando imagens e criando componentes reutilizáveis",
      "Redação da documentação Swagger detalhada para as rotas de API da fase 2, baseada nas necessidades das transações"
    ],
    "Site": "https://argent-bank-website-am-lesk.vercel.app/",
    "Repo": "https://github.com/augusto-mattos/ArgentBank-website-AM",
    "stack": ["React", "Redux", "API Rest", "Swagger"]
  },
  {
    "id": "nina-carducci",
    "title": "Nina Carducci",
    "update" :"12/12/2023",
    "cover": "nina-carducci-miniature.webp",
    "pictures": ["nina-carducci-1.webp", "nina-carducci-2.webp"],
    "description": [
      "Este projeto consistiu na otimização do site da Nina Carducci. Nele concentrei meus esforços em diversos aspectos, como performance, referenciamento local, SEO e acessibilidade. Após analisar a estrutura do site, minhas ações incluíram otimização de imagens, melhoria da estrutura do código, adição de referenciamento local e inclusão de tags meta para melhorar a presença nas redes sociais. Além disso, fiz ajustes específicos para melhorar a acessibilidade do site.",
      "O projeto foi finalizado com a entrega de um relatório detalhado de otimização, que incluiu análises pré e pós-otimização, com base em métricas como LightHouse para performance e SEO, Google Rich Snippet para referenciamento local e Wave para questões de acessibilidade."
    ],
    "actions": [
      "Otimização do site para melhorar a performance e SEO",
      "Implementação de referenciamento local usando Schema.org",
      "Adição de tags meta para melhorar o compartilhamento nas redes sociais",
      "Ajustes para aumentar a acessibilidade do site"
    ],
    "Site": "https://augusto-mattos.github.io/ninacarducci-optmisation/",
    "Repo": "https://github.com/augusto-mattos/ninacarducci-optmisation",
    "stack": ["HTML", "CSS", "SEO", "Performance", "Lighthouse", "Photoshop"]
  },
  {
    "id": "sophie-bluel",
    "title": "Portfolio Sophie Bluel",
    "update" :"09/10/2023",
    "cover": "sophie-bluel-miniature.webp",
    "pictures": ["sophie-bluel-1.webp", "sophie-bluel-2.webp"],
    "description": [
      "O principal objetivo deste projeto foi desenvolver um site para destacar os trabalhos da arquiteta Sophie Bluel. Para isso, uma página dedicada à apresentação dos trabalhos foi criada a partir do código HTML fornecido. Esta página permite recuperar e exibir dinamicamente os projetos existentes a partir do servidor back-end.",
      "Além disso, o projeto incluiu a implementação de um sistema de login destinado ao administrador do site, bem como a adição de funcionalidades para fazer upload de novas mídias e excluir trabalhos existentes."
    ],
    "actions": [
      "Recuperação dinâmica dos trabalhos do back-end para exibição no front-end",
      "Manipulação do DOM para garantir uma experiência do usuário fluente",
      "Integração do design das páginas para uma apresentação estética e funcional",
      "Implementação de um sistema de autenticação do usuário via API segura",
      "Criação de um sistema para excluir os trabalhos existentes e enviar novos projetos para o back-end por meio de um formulário de modal interativo",
      "Processamento das respostas da API para exibir dinamicamente as novas mídias na modal"
    ],
    "Site": "https://augusto-mattos.github.io/Portfolio-architecte-OC-AM/",
    "Repo": "https://github.com/augusto-mattos/Portfolio-architecte-OC-AM",
    "stack": ["HTML", "CSS", "JavaScript", "API Rest", "Figma"]
  },
  {
    "id": "oh-my-food",
    "title": "OhMyFood",
    "update" :"05/10/2023",
    "cover": "ohmyfood-miniature.webp",
    "pictures": ["ohmyfood-1.webp", "ohmyfood-2.webp"],
    "description": [
      "O principal objetivo deste projeto foi realizar a integração do site, dando atenção especial à abordagem \"mobile first\". O pacote do projeto incluía layouts para as versões mobile e desktop, bem como um protótipo no Figma.",
      "Os desafios incluíam a entrega do site em três versões diferentes para garantir sua adaptabilidade a vários dispositivos. O uso de SASS era obrigatório para otimizar o desenvolvimento e a manutenção do código."
    ],
    "actions": [
      "Integração da versão mobile da página inicial, alinhada com os layouts fornecidos",
      "Desenvolvimento de versões para tablet e desktop",
      "Adição de animações para melhorar a experiência do usuário",
      "Integração do código de uma página dedicada à apresentação dos restaurantes, de acordo com as especificações do projeto"
    ],
    "Site": "https://augusto-mattos.github.io/Ohmyfood-AM/",
    "Repo": "https://github.com/augusto-mattos/Ohmyfood-AM",
    "stack": ["HTML", "Sass", "Figma"]
  },
  {
    "id": "print-it",
    "title": "Print-it !",
    "update" :"28/08/2023",
    "cover": "print-it-miniature.webp",
    "pictures": ["print-it-1.webp", "print-it-2.webp"],
    "description": [
      "O objetivo do projeto era tornar funcional um banner composto por um carrossel de imagens, com a capacidade de percorrer suavemente as imagens em um loop contínuo.",
      "Para isso, após uma análise do código HTML e CSS do site, os elementos necessários para a implementação foram adicionados. Setas de navegação foram incluídas para permitir que os usuários navegassem entre as imagens. Event listeners foram configurados para detectar cliques nas setas e pontos de bala foram adicionados para indicar os diferentes slides do carrossel."
    ],
    "actions": [
      "Integração dos elementos de navegação para permitir a transição entre as imagens do carrossel",
      "Configuração de event listeners para detectar cliques nas setas e nos bullet points",
      "Correção de bugs para garantir o funcionamento adequado do carrossel, permitindo que ele seja capaz de passar de forma contínua pelas imagens em um loop infinito"
    ],
    "Site": "https://augusto-mattos.github.io/Print-it-JS-AM/",
    "Repo": "https://github.com/augusto-mattos/Print-it-JS-AM/",
    "stack": ["JavaScript", "HTML", "CSS"]
  },
  {
    "id": "booki",
    "title": "Booki",
    "update" :"27/11/2023",
    "cover": "booki-miniature.webp",
    "pictures": ["booki-1.webp", "booki-2.webp"],
    "description": [
      "O principal objetivo do projeto Booki era integrar a interface do site usando código HTML e CSS. Booki é uma agência de viagens online que permite aos usuários encontrar acomodações e atividades na cidade de sua escolha.",
      "Os protótipos do site em diferentes versões (desktop, tablet e mobile) foram fornecidos via Figma. O site precisava cumprir certas restrições técnicas, especialmente no que diz respeito ao comportamento das funções de pesquisa, links e cartões de acomodação e atividades."
    ],
    "actions": [
      "Recorte dos protótipos do Figma para identificar os elementos a serem integrados",
      "Integração dos componentes em HTML e CSS",
      "Adição de um formulário e filtros de pesquisa"
    ],
    "Site": "https://augusto-mattos.github.io/booki/",
    "Repo": "https://github.com/augusto-mattos/booki",
    "stack": ["HTML", "CSS", "Figma"]
  },
  {
    "id": "studion",
    "title": "StudiOn",
    "update" :"12/12/2023",
    "cover": "studion-miniature.webp",
    "pictures": ["studion-1.webp", "studion-2.webp"],
    "description": [
      "O projeto StudiOn envolveu a integração das diferentes páginas do site da agência de eventos usando HTML, CSS e JavaScript. Os layouts do site foram fornecidos no formato PSD.",
      "O foco foi na integração fiel da interface do site, garantindo uma navegação suave entre as páginas e aderindo aos layouts fornecidos."
    ],
    "actions": [
      "Recorte dos layouts para identificar os elementos a serem integrados",
      "Integração dos componentes em HTML e CSS",
      "Criação de uma barra de navegação dinâmica usando JavaScript"
    ],
    "Site": "https://studion-reprise.vercel.app/",
    "Repo": "https://github.com/augusto-mattos/studion-reprise",
    "stack": ["HTML", "CSS", "Photoshop", "JavaScript"]
  },
  {
    "id": "magbank",
    "title": "MagBank",
    "update" :"09/12/2022",
    "cover": "magbank-miniature.webp",
    "pictures": ["magbank-1.webp", "magbank-2.webp"],
    "description": [
      "O projeto MaGbank envolveu a integração das diferentes páginas do site usando React, React Router, Sass e JavaScript. O protótipo do site foi fornecido no formato PSD.",
      "A criação de uma rota privada foi planejada para garantir o acesso seguro ao dashboard quando o aplicativo for conectado ao backend. Foi enfatizada uma integração fiel à interface do site, garantindo uma navegação fluida entre as páginas e respeitando o layout fornecido."
    ],
    "actions": [
      "Desenvolvimento do site com React",
      "Integração dos componentes",
      "Uso de Sass para o estilo",
      "Criação de uma rota privada para garantir o acesso ao dashboard somente após a conexão do usuário"
    ],
    "Site": "https://magbank-ten.vercel.app/",
    "Repo": "https://github.com/augusto-mattos/magbank",
    "stack": ["React", "React Router", "Sass", "JavaScript"]
  },
  {
    "id": "imagiflix",
    "title": "Imagiflix",
    "update" :"29/02/2024",
    "cover": "imagiflix-miniature.webp",
    "pictures": ["imagiflix-1.webp", "imagiflix-2.webp"],
    "description": [
      "O projeto Imagiflix concentrou-se na criação da interface do usuário e na integração com a API do The Movie DB. Uma aplicação web foi desenvolvida utilizando React e seguindo os princípios de design do Tailwind CSS.",
      "A integração incluiu chamadas à API do The Movie DB para obter dados sobre filmes e séries, proporcionando aos usuários acesso a uma vasta biblioteca de conteúdo. A integração do React Slick foi utilizada para criar carrosséis interativos e atraentes, oferecendo uma experiência de navegação suave e visualmente agradável."
    ],
    "actions": [
      "Desenvolvimento da aplicação web Imagiflix utilizando React",
      "Integração do Tailwind CSS para design e estilo",
      "Utilização da API do The Movie DB para obter dados sobre filmes e séries",
      "Implementação do React Slick para criar carrosséis interativos"
    ],
    "Site": "https://imagiflix.vercel.app/",
    "Repo": "https://github.com/augusto-mattos/imagiflix",
    "stack": ["React", "API Rest", "Tailwind CSS", "CSS", "JavaScript"]
  },
  {
    "id": "julia-peixotto",
    "title": "Júlia Peixotto",
    "update" :"07/06/2024",
    "cover": "julia-miniature.webp",
    "pictures": ["julia-1.webp", "julia-2.webp"],
    "description": [
      "O site da cantora Júlia Peixotto foi desenvolvido usando React e Sass. Ele explora dados da API Spotify para carregar os singles e albuns disponíveis na plataforma. Os usuários podem explorar o universo da artista através de uma interface visual intuitiva, concebida usando o Figma. Na página onde estão as produções musicais, além dos albuns, é possível também ver letras de músicas. Essa seção do site usa accordions baseados em MUI.",
      "Para garantir a gestão e atualização da agenda, optei por usar Firebase para garantir a conexão com uma interface admin e armazenar as informações relativas ao eventos da cantora. O projeto incluiu também a otimização de SEO, incluindo referenciamento local e um sitemap para melhorar a visibilidade nos buscadores."
    ],
    "actions": [
      "Desenvolvimento do site usando React e Sass",
      "Integração com a API do Spotify para obter dados dos álbuns",
      "Criação do protótipo no Figma",
      "Uso do Firebase para gestão de conexão admin e armazemento de dados",
      "Uso de MUI para criação de accordions",
      "Otimização de SEO e referenciamento local",
      "Inclusão de um sitemap para melhorar a visibilidade nos motores de busca"
    ],
    "Site": "https://juliapeixotto.com.br/",
    "Repo": "https://github.com/augusto-mattos/julia-peixotto",
    "stack": ["React", "API Rest", "Sass", "JavaScript", "Figma", "Firebase", "MUI"]
  }
]
 