[
  {
    "id": "kasa",
    "title": "Kasa",
    "cover": "kasa-miniature.webp",
    "pictures": ["kasa-1.webp", "kasa-2.webp"],
    "resume": "Ce projet prévoyait la refonte complète de l'application Kasa, avec une transition réussie vers une stack JavaScript intégrale, utilisant React et Sass en frontend.",
    "description": [
      "Le projet visait une refonte totale de l'application Kasa, avec une migration vers une stack complète en JavaScript, intégrant Node.JS côté backend et React côté frontend.",
      "Le démarrage du projet React a impliqué le développement de composants et de routes en accord avec les maquettes Figma, en utilisant les données extraites d'un fichier JSON d'annonces immobilières."
    ],
    "actions": [
      "Utilisation de Create React App",
      "Développement de composants React et de routes React Router",
      "Utilisation d’un fichier JSON avec les annonces de logements pour construire le frontend",
      "Implémentation des maquettes Figma, en veillant aux logiques de composants réutilisables",
      "Adoption de Sass pour la stylisation et l’animation de l’interface web"
    ],
    "Site": "https://kasa-lake.vercel.app/",
    "Repo": "https://github.com/augusto-mattos/kasa",
    "stack": ["Sass", "React", "React Router", "Figma"]
  },
  {
    "id": "724-events",
    "title": "724 Events",
    "cover": "724events-miniature.webp",
    "pictures": ["724events-1.webp", "724events-2.webp"],
    "resume": "Le projet 724 Events consiste au débogage du site d'une agence d'événementiel, utilisant React DevTools et des tests unitaires et d'intégration.",
    "description": [
      "Le projet 724 Events se concentre sur le débogage d'un site d'agence d'événementiel fonctionnel mais affecté par des bugs.",
      "Utilisant React et Jest, les actions menées ont inclus l'analyse des problèmes, l'examen du code pour identifier d'autres bugs, la résolution des problèmes détectés, et la rédaction du cahier de recette avec des scénarios de test. Les Chrome DevTools ont été employées pour le débogage web, et les tests unitaires et d'intégration existants ont été intégrés pour garantir la stabilité du site après les corrections."
    ],
    "actions": [
      "Analyse des problèmes répertoriés en amont",
      "Examen du code afin d’identifier d’autres bugs",
      "Résolution des bugs détectés",
      "Rédaction du cahier de recette avec des scénarios de test",
      "Utilisation des Chrome DevTools pour le débogage",
      "Création et application des tests unitaires et d'intégration existants dans le processus de correction des bugs"
    ],
    "Site": "https://debuggez-une-application-react-js-am.vercel.app/",
    "Repo": "https://github.com/augusto-mattos/Debuggez-une-application-React.JS-AM",
    "stack": ["React", "Jest"]
  },
  {
    "id": "argent-bank",
    "title": "Argent Bank",
    "cover": "argent-bank-miniature.webp",
    "pictures": ["argent-bank-1.webp", "argent-bank-2.webp"],
    "resume": "Ce projet construit en React compte avec l’implémentation de Redux et l’écriture d’une documentation Swagger pour détailler la proposition des nouvelles routes API.",
    "description": [
      "Ce projet a commencé par la phase 1, focalisée sur l'authentification des utilisateurs. À partir du HTML et du CSS fournis, une application web a été créée avec React, suivant les normes de Green Code. L'intégration a inclus l'appel à une API pour obtenir les données de l'utilisateur et accéder à l’application. Redux a été implémenté pour gérer l'état global, permettant aux utilisateurs de visiter la page d'accueil, de se connecter, de se déconnecter, et de visualiser leur profil. La modification du nom et du prénom a été restreinte, mais la possibilité de modifier le nom d'utilisateur (username) a été permise.",
      "La phase 2 a impliqué l'élaboration d'une documentation Swagger détaillée pour les routes API liées aux transactions, en prenant en compte les besoins spécifiques dans l'évolution de l'application et en garantissant la cohérence avec les développements antérieurs."
    ],
    "actions": [
      "Création de l'application web réactive avec React",
      "Mise en œuvre de Redux pour la gestion de l'état global",
      "Gestion de l'authentification des utilisateurs avec des Private Routes et appel à une API pour les données utilisateur",
      "Intégration des pages en suivant les bonnes pratiques de Green Code, en optimisant les images et en créant des composants réutilisables",
      "Rédaction de la documentation Swagger détaillée pour les routes API de la phase 2, en se basant sur les besoins des transactions"
    ],
    "Site": "https://argent-bank-website-am-lesk.vercel.app/",
    "Repo": "https://github.com/augusto-mattos/ArgentBank-website-AM",
    "stack": ["React", "Redux", "API Rest", "Swagger"]
  },
  {
    "id": "nina-carducci",
    "title": "Nina Carducci",
    "cover": "nina-carducci-miniature.webp",
    "pictures": ["nina-carducci-1.webp", "nina-carducci-2.webp"],
    "resume": "Ce projet consiste à optimiser la performance d’un site web en tenant compte du référencement local, du SEO et de l’accessibilité.",
    "description": [
      "Este projeto consistiu na otimização do site da Nina Carducci. Nele concentrei meus esforços em diversos aspectos, como performance, referenciamento local, SEO e acessibilidade. Após analisar a estrutura do site, minhas ações incluíram otimização de imagens, melhoria da estrutura do código, adição de referenciamento local e inclusão de tags meta para melhorar a presença nas redes sociais. Além disso, fiz ajustes específicos para melhorar a acessibilidade do site.",
      "O projeto foi finalizado com a entrega de um relatório detalhado de otimização, que incluiu análises pré e pós-otimização, com base em métricas como LightHouse para performance e SEO, Google Rich Snippet para referenciamento local e Wave para questões de acessibilidade."
    ],
    "actions": [
      "Otimização do site para melhorar a performance e SEO",
      "Implementação de referenciamento local usando Schema.org",
      "Adição de tags meta para melhorar o compartilhamento nas redes sociais",
      "Ajustes para aumentar a acessibilidade do site"
    ],
    "Site": "https://augusto-mattos.github.io/ninacarducci-optmisation/",
    "Repo": "https://github.com/augusto-mattos/ninacarducci-optmisation",
    "stack": ["HTML", "CSS", "SEO", "Performance", "Lighthouse", "Photoshop"]
  },
  {
    "id": "sophie-bluel",
    "title": "Portfolio Sophie Bluel",
    "cover": "sophie-bluel-miniature.webp",
    "pictures": ["sophie-bluel-1.webp", "sophie-bluel-2.webp"],
    "resume": "Ce projet vise à développer les fonctionnalités principales du portfolio de Sophie Bluel sur le front-end.",
    "description": [
      "L'objectif principal de ce projet était de concevoir un site web opérationnel pour mettre en valeur les travaux de l'architecte Sophie Bluel. Pour ce faire, une page dédiée à la présentation des travaux a été créée à partir du code HTML fourni. Cette page permet de récupérer et d'afficher dynamiquement les projets existants depuis le serveur back-end.",
      "De plus, le projet incluait la mise en place d'un système de connexion destiné à l'administrateur du site, ainsi que l'ajout de fonctionnalités permettant de télécharger de nouveaux médias et de supprimer des travaux existants."
    ],
    "actions": [
      "Récupération dynamique des travaux depuis le back-end pour leur affichage en front-end",
      "Manipulation du DOM pour assurer une expérience utilisateur fluide",
      "Intégration du design des pages pour une présentation esthétique et fonctionnelle",
      "Mise en place d'un système d’authentification utilisateur via une API sécurisée",
      "Création d'un système de suppression des travaux existants et d'envoi de nouveaux projets vers le back-end via un formulaire de modalité interactive",
      "Traitement des réponses de l’API afin d'afficher de manière dynamique les nouveaux médias dans la modalité"
    ],
    "Site": "https://augusto-mattos.github.io/Portfolio-architecte-OC-AM/",
    "Repo": "https://github.com/augusto-mattos/Portfolio-architecte-OC-AM",
    "stack": ["HTML", "CSS", "JavaScript", "API Rest", "Figma"]
  },
  {
    "id": "oh-my-food",
    "title": "OhMyFood",
    "cover": "ohmyfood-miniature.webp",
    "pictures": ["ohmyfood-1.webp", "ohmyfood-2.webp"],
    "resume": "Le projet visait à développer un site web \"mobile first\" répertoriant les menus de restaurants gastronomiques.",
    "description": [
      "L'objectif principal de ce projet était de réaliser l'intégration du site en accordant une attention particulière à la version \"mobile first\". Le dossier de projet incluait des maquettes pour les versions mobile et desktop, ainsi qu'un prototype sur Figma.",
      "Les contraintes comprenaient la livraison du site dans trois versions différentes afin de s'assurer de son adaptabilité à divers appareils. L'utilisation de SASS était obligatoire pour optimiser le développement et la maintenance du code."
    ],
    "actions": [
      "Intégration de la version mobile de la page d'accueil, en alignement avec les maquettes fournies",
      "Développement de versions pour tablette et desktop",
      "Ajout d'animations pour améliorer l'expérience utilisateur",
      "Intégration du code d'une page dédiée à la présentation des restaurants, conformément aux spécifications du projet"
    ],
    "Site": "https://augusto-mattos.github.io/Ohmyfood-AM/",
    "Repo": "https://github.com/augusto-mattos/Ohmyfood-AM",
    "stack": ["HTML", "Sass", "Figma"]
  },
  {
    "id": "print-it",
    "title": "Print-it !",
    "cover": "print-it-miniature.webp",
    "pictures": ["print-it-1.webp", "print-it-2.webp"],
    "resume": "Le projet visait à dynamiser un site web statique en ajoutant un carrousel interactif.",
    "description": [
      "L'objectif du projet était de rendre une bannière composée d’un carrousel d’images fonctionnel, avec la possibilité de passer en boucle de manière fluide entre les images.",
      "Pour cela, après une analyse du code HTML et CSS du site, les éléments nécessaires à l’implémentation du site ont été ajoutés. Des flèches de navigation ont été ajoutées pour permettre aux utilisateurs de passer d'une image à l'autre. Des event listeners ont été mis en place pour détecter les clics sur les flèches et des bullet points ont été ajoutés pour indiquer les différentes diapositives du carrousel."
    ],
    "actions": [
      "Intégration des éléments de navigation pour permettre le passage entre les images du carrousel",
      "Mise en place d'event listeners pour détecter les clics sur les flèches et les bullets points",
      "Correction des bugs pour assurer le bon fonctionnement du carrousel, notamment en le rendant capable de tourner en boucle indéfiniment"
    ],
    "Site": "https://augusto-mattos.github.io/Print-it-JS-AM/",
    "Repo": "https://github.com/augusto-mattos/Print-it-JS-AM/",
    "stack": ["JavaScript", "HTML", "CSS"]
  },
  {
    "id": "booki",
    "title": "Booki",
    "cover": "booki-miniature.webp",
    "pictures": ["booki-1.webp", "booki-2.webp"],
    "resume": "Pour ce projet, l’objectif était de développer un site Internet permettant aux usagers de trouver des hébergements et des activités dans la ville de leur choix.",
    "description": [
      "L'objectif principal du projet Booki était d'intégrer l'interface du site web en utilisant du code HTML et CSS. Booki est une agence de voyage en ligne qui permet aux usagers de trouver des hébergements et des activités dans la ville de leur choix.",
      "Des maquettes du site dans différentes versions (desktop, tablette et mobile) ont été fournies via Figma. Le site devait respecter certaines contraintes techniques, notamment en ce qui concerne le comportement des fonctions de recherche, les liens et les cartes d'hébergement et d'activités."
    ],
    "actions": [
      "Découpage des maquettes Figma pour identifier les éléments à intégrer",
      "Intégration des composants en HTML et CSS",
      "Ajout d’un formulaire et des filtres de recherche"
    ],
    "Site": "https://augusto-mattos.github.io/booki/",
    "Repo": "https://github.com/augusto-mattos/booki",
    "stack": ["HTML", "CSS", "Figma"]
  },{
    "id": "studion",
    "title": "StudiOn",
    "cover": "studion-miniature.webp",
    "pictures": ["studion-1.webp", "studion-2.webp"],
    "resume": "Celui-ci est mon tout premier projet, développé dans le cadre de ma formation chez Imagine School. L'objectif principal était de développer un site web pour une agence événementielle nommée StudiOn.",
    "description": [
      "Le projet StudiOn impliquait l'intégration des différentes pages du site de l'agence événementielle en utilisant HTML, CSS et JavaScript. Les maquettes du site ont été fournies au format PSD.",
      "L'accent a été mis sur l'intégration fidèle de l'interface du site web, en garantissant une navigation fluide entre les pages et en respectant les maquettes fournies."
    ],
    "actions": [
      "Découpage des maquettes pour identifier les éléments à intégrer",
      "Intégration des composants en HTML et CSS",
      "Création d'une barre de navigation dynamique en utilisant JavaScript"
    ],
    "Site": "https://studion-reprise.vercel.app/ ",
    "Repo": "https://github.com/augusto-mattos/studion-reprise",
    "stack": ["HTML", "CSS", "Photoshop", "JavaScript"]
  }
]
 